/*  Copyright (c) 1992-2005 CodeGen, Inc.  All rights reserved.
 *
 *  Redistribution and use in source and binary forms, with or without
 *  modification, are permitted provided that the following conditions
 *  are met:
 *  1. Redistributions of source code must retain the above copyright
 *     notice, this list of conditions and the following disclaimer.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimer in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Redistributions in any form must be accompanied by information on
 *     how to obtain complete source code for the CodeGen software and any
 *     accompanying software that uses the CodeGen software.  The source code
 *     must either be included in the distribution or be available for no
 *     more than the cost of distribution plus a nominal fee, and must be
 *     freely redistributable under reasonable conditions.  For an
 *     executable file, complete source code means the source code for all
 *     modules it contains.  It does not include source code for modules or
 *     files that typically accompany the major components of the operating
 *     system on which the executable file runs.  It does not include
 *     source code generated as output by a CodeGen compiler.
 *
 *  THIS SOFTWARE IS PROVIDED BY CODEGEN AS IS AND ANY EXPRESS OR IMPLIED

 *  THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 *  (Commercial source/binary licensing and support is also available.
 *   Please contact CodeGen for details. http://www.codegen.com/)
 */

/* (c) Copyright 1996-1998 by CodeGen, Inc.  All Rights Reserved. */

/* Driver for NCR/Symbios 53C8xx family of SCSI PCI chips.
   Uses /packages/scsi to do the SCSI-specific commands.
 */

#include "defs.h"
#include "pci.h"
#include "scsi.h"

/* define this to turn on special DMA-test hacks - originally intended
   to test PCI bus hang on MIPS NKK system */
/*#define DMA_TEST*/


/* NCR struct def copied and modified from OpenBSD's /sys/pci/ncrreg.h.
   Original copyrights follow.
 */

/**************************************************************************
**
**  $Id: ncrscsi.c,v 1.12 1999/01/25 22:35:35 parag Exp $
**
**  Device driver for the   NCR 53C810   PCI-SCSI-Controller.
**
**  386bsd / FreeBSD / NetBSD
**
**-------------------------------------------------------------------------
**
**  Written for 386bsd and FreeBSD by
**	wolf@cologne.de		Wolfgang Stanglmeier
**	se@mi.Uni-Koeln.de	Stefan Esser
**
**  Ported to NetBSD by
**	mycroft@gnu.ai.mit.edu
**
**-------------------------------------------------------------------------
**
** Copyright (c) 1994 Wolfgang Stanglmeier.  All rights reserved.
**
** Redistribution and use in source and binary forms, with or without
** modification, are permitted provided that the following conditions
** are met:
** 1. Redistributions of source code must retain the above copyright
**    notice, this list of conditions and the following disclaimer.
** 2. Redistributions in binary form must reproduce the above copyright
**    notice, this list of conditions and the following disclaimer in the
**    documentation and/or other materials provided with the distribution.
** 3. The name of the author may not be used to endorse or promote products
**    derived from this software without specific prior written permission.
**
** THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
** IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
** OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
** IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
** INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
** NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
** DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
** THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
** (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
** THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
**
***************************************************************************
*/


/*-----------------------------------------------------------------
**
**	The ncr 53c810 register structure.
**
**-----------------------------------------------------------------
*/

struct ncr_reg
{
	/* standard PCI registers - normally accessed only through config space */
		uInt	vendor_dev_id;
		uInt	cmd_status;
		uInt	class_rev;
		uInt	cache_latency_header;
		uInt	base0;
		uInt	base1;
		uInt	_not_supported[4];
		uInt	_reserved[5];
		uInt	intr_line_pin_mingnt_maxlat;

		uChar    _gap[0x40];

	/* NCR-specific regs start at 0x80 */

/*00*/  uChar    scntl0;    /* full arb., ena parity, par->ATN  */
		#define ARB		0xC0	/* 0=simple, C=full arbitration */
		#define START	0x20	/* start sequence */
		#define WATN	0x10	/* select with SATN/ on a start sequence */
		#define EPC		0x80	/* enable parity checking */
		#define AAP		0x02	/* assert SATN/ on parity error */
		#define TRG		0x01	/* target role */

/*01*/  uChar    scntl1;    /* no reset                         */
        #define   EXC     0x80  /* extra clock cycle of data setup */
		#define   ADB     0x40	/* assert SCSI data bus */
        #define   ISCON   0x10  /* connected to scsi		    */
        #define   CRST    0x08  /* force reset                      */

/*02*/  uChar    scntl2;    /* no disconnect expected           */
	#define   SDU     0x80  /* cmd: disconnect will raise error */
	#define   CHM     0x40  /* sta: chained mode                */
	#define   WSS     0x08  /* sta: wide scsi send           [W]*/
	#define   WSR     0x01  /* sta: wide scsi received       [W]*/

/*03*/  uChar    scntl3;    /* cnf system clock dependent       */
	#define   EWS     0x08  /* cmd: enable wide scsi         [W]*/

/*04*/  uChar    scid;	/* cnf host adapter scsi address    */
	#define   RRE     0x40  /* r/w:e enable response to resel.  */
	#define   SRE     0x20  /* r/w:e enable response to select  */

/*05*/  uChar    sxfer;	/* ### Sync speed and count         */

/*06*/  uChar    sdid;	/* ### Destination-ID               */

/*07*/  uChar    gpreg;	/* ??? IO-Pins                      */

/*08*/  uChar    sfbr;	/* ### First byte in phase          */

/*09*/  uChar    socl;
	#define   CREQ	  0x80	/* r/w: SCSI-REQ                    */
	#define   CACK	  0x40	/* r/w: SCSI-ACK                    */
	#define   CBSY	  0x20	/* r/w: SCSI-BSY                    */
	#define   CSEL	  0x10	/* r/w: SCSI-SEL                    */
	#define   CATN	  0x08	/* r/w: SCSI-ATN                    */
	#define   CMSG	  0x04	/* r/w: SCSI-MSG                    */
	#define   CCD	  0x02	/* r/w: SCSI-C_D                    */
	#define   CIO	  0x01	/* r/w: SCSI-I_O                    */
	#define   PHASE   (CMSG | CCD | CIO)
	#define   PDATAOUT	0
	#define   PDATAIN	CIO
	#define   PCMD		CCD
	#define   PSTATUS	(CCD | CIO)
	#define   PMSGOUT	(CMSG | CCD)
	#define   PMSGIN	(CMSG | CCD | CIO)

/*0a*/  uChar    ssid;

/*0b*/  uChar    sbcl;		/* same bits as socl above */

/*0c*/  uChar    dstat;
        #define   DFE     0x80  /* sta: dma fifo empty              */
        #define   MDPE    0x40  /* int: master data parity error    */
        #define   BF      0x20  /* int: script: bus fault           */
        #define   ABRT    0x10  /* int: script: command aborted     */
        #define   SSI     0x08  /* int: script: single step         */
        #define   SIR     0x04  /* int: script: interrupt instruct. */
        #define   IID     0x01  /* int: script: illegal instruct.   */

/*0d*/  uChar    sstat0;
        #define   ILF     0x80  /* sta: data in SIDL register lsb   */
        #define   ORF     0x40  /* sta: data in SODR register lsb   */
        #define   OLF     0x20  /* sta: data in SODL register lsb   */
        #define   AIP     0x10  /* sta: arbitration in progress     */
        #define   LOA     0x08  /* sta: arbitration lost            */
        #define   WOA     0x04  /* sta: arbitration won             */
        #define   IRST    0x02  /* sta: scsi reset signal           */
        #define   SDP     0x01  /* sta: scsi parity signal          */

/*0e*/  uChar    sstat1;
	#define   FF3210  0xf0	/* sta: bytes in the scsi fifo      */

/*0f*/  uChar    sstat2;
        #define   ILF1    0x80  /* sta: data in SIDL register msb[W]*/
        #define   ORF1    0x40  /* sta: data in SODR register msb[W]*/
        #define   OLF1    0x20  /* sta: data in SODL register msb[W]*/
        #define   LDSC    0x02  /* sta: disconnect & reconnect      */

/*10*/  uInt    dsa;	/* --> Base page                    */

/*14*/  uChar    istat;	/* --> Main Command and status      */
        #define   CABRT   0x80  /* cmd: abort current operation     */
        #define   SRST    0x40  /* mod: reset chip                  */
        #define   SIGP    0x20  /* r/w: message from host to ncr    */
        #define   SEM     0x10  /* r/w: message between host + ncr  */
        #define   CON     0x08  /* sta: connected to scsi           */
        #define   INTF    0x04  /* sta: int on the fly (reset by wr)*/
        #define   SIP     0x02  /* sta: scsi-interrupt              */
        #define   DIP     0x01  /* sta: host/script interrupt       */

/*15*/  uChar    _15_;
/*16*/	uChar	  _16_;
/*17*/  uChar    _17_;

/*18*/	uChar	  ctest0;
/*19*/  uChar    ctest1;

/*1a*/  uChar    ctest2;
	#define   CSIGP   0x40

/*1b*/  uChar    ctest3;
	#define   CLF	  0x04	/* clear scsi fifo		    */

/*1c*/  uInt    temp;	/* ### Temporary stack              */

/*20*/	uChar	  dfifo;
/*21*/  uChar    ctest4;
/*22*/  uChar    ctest5;
/*23*/  uChar    ctest6;

/*24*/  uInt    dbc;	/* ### Byte count and command       */
/*28*/  uInt    dnad;	/* ### Next command register        */
/*2c*/  uInt    dsp;	/* --> Script Pointer               */
/*30*/  uInt    dsps;	/* --> Script pointer save/opcode#2 */
/*34*/  uInt    scratcha;  /* ??? Temporary register a         */

/*38*/  uChar    dmode;
/*39*/  uChar    dien;
/*3a*/  uChar    dwt;

/*3b*/  uChar    dcntl;	/* --> Script execution control     */
        #define   SSM     0x10  /* mod: single step mode            */
        #define   STD     0x04  /* cmd: start dma mode              */
	#define	  NOCOM   0x01	/* cmd: protect sfbr while reselect */

/*3c*/  uInt    adder;

/*40*/  uShort   sien;	/* -->: interrupt enable            */
/*42*/  uShort   sist;	/* <--: interrupt status            */
        #define   STO     0x0400/* sta: timeout (select)            */
        #define   GEN     0x0200/* sta: timeout (general)           */
        #define   HTH     0x0100/* sta: timeout (handshake)         */
        #define   MA      0x80  /* sta: phase mismatch              */
        #define   CMP     0x40  /* sta: arbitration complete        */
        #define   SEL     0x20  /* sta: selected by another device  */
        #define   RSL     0x10  /* sta: reselected by another device*/
        #define   SGE     0x08  /* sta: gross error (over/underflow)*/
        #define   UDC     0x04  /* sta: unexpected disconnect       */
        #define   RST     0x02  /* sta: scsi bus reset detected     */
        #define   PAR     0x01  /* sta: scsi parity error           */

/*44*/  uChar    slpar;
/*45*/  uChar    swide;
/*46*/  uChar    macntl;
/*47*/  uChar    gpcntl;
/*48*/  uChar    stime0;    /* cmd: timeout for select&handshake*/
/*49*/  uChar    stime1;    /* cmd: timeout user defined        */
/*4a*/  uShort   respid;    /* sta: Reselect-IDs                */

/*4c*/  uChar    stest0;

/*4d*/  uChar    stest1;

/*4e*/  uChar    stest2;
	#define   ROF     0x40	/* reset scsi offset (after gross error!) */
	#define   EXT     0x02  /* extended filtering                     */

/*4f*/  uChar    stest3;
	#define   TE     0x80	/* c: tolerAnt enable */
	#define   CSF    0x02	/* c: clear scsi fifo */

/*50*/  uShort   sidl;	/* Lowlevel: latched from scsi data */
/*52*/  uShort   _52_;
/*54*/  uShort   sodl;	/* Lowlevel: data out to scsi data  */
/*56*/  uShort   _56_;
/*58*/  uShort   sbdl;	/* Lowlevel: data from scsi data    */
/*5a*/  uShort   _5a_;
/*5c*/  uChar    scr0;	/* Working register B               */
/*5d*/  uChar    scr1;	/*                                  */
/*5e*/  uChar    scr2;	/*                                  */
/*5f*/  uChar    scr3;	/*                                  */
/*60*/
};

/* end of BSD code */



/* various macros */
#define OURID			7			/* hardwire our SCSI ID for now */
#define REG_SIZE		0x100		/* size of memory-mapped registers */
#define MAX_TRANSFER	(1024*4)

/* sizes of various buffers */
#define SIZE_CMD		12
#define SIZE_DATA		MAX_TRANSFER
#define SIZE_SHORTDATA	256

#ifdef DMA_TEST
#define BUF_SIZE	(1024*16)
#define DMA_LEN		(BUF_SIZE / 4)
#endif


/* instance-specific vars */
struct self
{
	Int physhi, physmid, physlo, sizehi, sizelo;

	volatile struct ncr_reg *reg;	/* mapped-in pointer to registers */

	/* pointers to cmd/data for I/O to/from user buffers */
	Byte *cmd;
	Int cmdlen;
	Byte *data;
	Int datalen;
	Int dir;
	Int hwerr;

	Int id, lun;			/* SCSI ID/LUN of target device for SCSI cmds */
	Int timeout;			/* timeout in ms for subsequent SCSI cmds */

	/* various data buffers - no need to DMA since we use programmed I/O */
	uChar idmsg;
	uChar rcvmsg;
	uChar status;
